benchmarks/results/2026-07-01T03-18-36Z-load.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: benchmarks/load.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 2m15s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 1m45s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 22 complete and 0 interrupted iterations
default   [   1% ] 01/10 VUs  0m00.9s/1m45.0s

running (0m02.0s), 01/10 VUs, 52 complete and 0 interrupted iterations
default   [   2% ] 01/10 VUs  0m01.9s/1m45.0s

running (0m03.0s), 01/10 VUs, 81 complete and 0 interrupted iterations
default   [   3% ] 01/10 VUs  0m02.9s/1m45.0s

running (0m04.0s), 02/10 VUs, 116 complete and 0 interrupted iterations
default   [   4% ] 02/10 VUs  0m03.9s/1m45.0s

running (0m05.0s), 02/10 VUs, 152 complete and 0 interrupted iterations
default   [   5% ] 02/10 VUs  0m04.9s/1m45.0s

running (0m06.0s), 02/10 VUs, 190 complete and 0 interrupted iterations
default   [   6% ] 02/10 VUs  0m05.9s/1m45.0s

running (0m07.0s), 03/10 VUs, 231 complete and 0 interrupted iterations
default   [   7% ] 03/10 VUs  0m06.9s/1m45.0s

running (0m08.0s), 03/10 VUs, 270 complete and 0 interrupted iterations
default   [   7% ] 03/10 VUs  0m07.9s/1m45.0s

running (0m09.0s), 03/10 VUs, 297 complete and 0 interrupted iterations
default   [   8% ] 03/10 VUs  0m08.9s/1m45.0s

running (0m10.0s), 03/10 VUs, 317 complete and 0 interrupted iterations
default   [   9% ] 03/10 VUs  0m09.9s/1m45.0s

running (0m11.0s), 04/10 VUs, 350 complete and 0 interrupted iterations
default   [  10% ] 04/10 VUs  0m10.9s/1m45.0s

running (0m12.0s), 04/10 VUs, 387 complete and 0 interrupted iterations
default   [  11% ] 04/10 VUs  0m11.9s/1m45.0s

running (0m13.0s), 04/10 VUs, 427 complete and 0 interrupted iterations
default   [  12% ] 04/10 VUs  0m12.9s/1m45.0s

running (0m14.0s), 05/10 VUs, 469 complete and 0 interrupted iterations
default   [  13% ] 05/10 VUs  0m13.9s/1m45.0s

running (0m15.0s), 05/10 VUs, 508 complete and 0 interrupted iterations
default   [  14% ] 05/10 VUs  0m14.9s/1m45.0s

running (0m16.0s), 05/10 VUs, 550 complete and 0 interrupted iterations
default   [  15% ] 05/10 VUs  0m15.9s/1m45.0s

running (0m17.0s), 06/10 VUs, 589 complete and 0 interrupted iterations
default   [  16% ] 06/10 VUs  0m16.9s/1m45.0s

running (0m18.0s), 06/10 VUs, 630 complete and 0 interrupted iterations
default   [  17% ] 06/10 VUs  0m17.9s/1m45.0s

running (0m19.0s), 06/10 VUs, 672 complete and 0 interrupted iterations
default   [  18% ] 06/10 VUs  0m18.9s/1m45.0s

running (0m20.0s), 06/10 VUs, 710 complete and 0 interrupted iterations
default   [  19% ] 06/10 VUs  0m19.9s/1m45.0s

running (0m21.0s), 07/10 VUs, 752 complete and 0 interrupted iterations
default   [  20% ] 07/10 VUs  0m20.9s/1m45.0s

running (0m22.0s), 07/10 VUs, 791 complete and 0 interrupted iterations
default   [  21% ] 07/10 VUs  0m21.9s/1m45.0s

running (0m23.0s), 07/10 VUs, 827 complete and 0 interrupted iterations
default   [  22% ] 07/10 VUs  0m22.9s/1m45.0s

running (0m24.0s), 08/10 VUs, 863 complete and 0 interrupted iterations
default   [  23% ] 08/10 VUs  0m23.9s/1m45.0s

running (0m25.0s), 08/10 VUs, 905 complete and 0 interrupted iterations
default   [  24% ] 08/10 VUs  0m24.9s/1m45.0s

running (0m26.0s), 08/10 VUs, 947 complete and 0 interrupted iterations
default   [  25% ] 08/10 VUs  0m25.9s/1m45.0s

running (0m27.0s), 09/10 VUs, 983 complete and 0 interrupted iterations
default   [  26% ] 09/10 VUs  0m26.9s/1m45.0s

running (0m28.0s), 09/10 VUs, 1024 complete and 0 interrupted iterations
default   [  27% ] 09/10 VUs  0m27.9s/1m45.0s

running (0m29.0s), 09/10 VUs, 1066 complete and 0 interrupted iterations
default   [  27% ] 09/10 VUs  0m28.9s/1m45.0s

running (0m30.0s), 09/10 VUs, 1105 complete and 0 interrupted iterations
default   [  28% ] 09/10 VUs  0m29.9s/1m45.0s

running (0m31.0s), 10/10 VUs, 1144 complete and 0 interrupted iterations
default   [  29% ] 10/10 VUs  0m30.9s/1m45.0s

running (0m32.0s), 10/10 VUs, 1183 complete and 0 interrupted iterations
default   [  30% ] 10/10 VUs  0m31.9s/1m45.0s

running (0m33.0s), 10/10 VUs, 1214 complete and 0 interrupted iterations
default   [  31% ] 10/10 VUs  0m32.9s/1m45.0s

running (0m34.0s), 10/10 VUs, 1250 complete and 0 interrupted iterations
default   [  32% ] 10/10 VUs  0m33.9s/1m45.0s

running (0m35.0s), 10/10 VUs, 1289 complete and 0 interrupted iterations
default   [  33% ] 10/10 VUs  0m34.9s/1m45.0s

running (0m36.0s), 10/10 VUs, 1331 complete and 0 interrupted iterations
default   [  34% ] 10/10 VUs  0m35.9s/1m45.0s

running (0m37.0s), 10/10 VUs, 1370 complete and 0 interrupted iterations
default   [  35% ] 10/10 VUs  0m36.9s/1m45.0s

running (0m38.0s), 10/10 VUs, 1409 complete and 0 interrupted iterations
default   [  36% ] 10/10 VUs  0m37.9s/1m45.0s

running (0m39.0s), 10/10 VUs, 1451 complete and 0 interrupted iterations
default   [  37% ] 10/10 VUs  0m38.9s/1m45.0s

running (0m40.0s), 10/10 VUs, 1490 complete and 0 interrupted iterations
default   [  38% ] 10/10 VUs  0m39.9s/1m45.0s

running (0m41.0s), 10/10 VUs, 1529 complete and 0 interrupted iterations
default   [  39% ] 10/10 VUs  0m40.9s/1m45.0s

running (0m42.0s), 10/10 VUs, 1567 complete and 0 interrupted iterations
default   [  40% ] 10/10 VUs  0m41.9s/1m45.0s

running (0m43.0s), 10/10 VUs, 1607 complete and 0 interrupted iterations
default   [  41% ] 10/10 VUs  0m42.9s/1m45.0s

running (0m44.0s), 10/10 VUs, 1646 complete and 0 interrupted iterations
default   [  42% ] 10/10 VUs  0m43.9s/1m45.0s

running (0m45.0s), 10/10 VUs, 1685 complete and 0 interrupted iterations
default   [  43% ] 10/10 VUs  0m44.9s/1m45.0s

running (0m46.0s), 10/10 VUs, 1727 complete and 0 interrupted iterations
default   [  44% ] 10/10 VUs  0m45.9s/1m45.0s

running (0m47.0s), 10/10 VUs, 1761 complete and 0 interrupted iterations
default   [  45% ] 10/10 VUs  0m46.9s/1m45.0s

running (0m48.0s), 10/10 VUs, 1799 complete and 0 interrupted iterations
default   [  46% ] 10/10 VUs  0m47.9s/1m45.0s

running (0m49.0s), 10/10 VUs, 1835 complete and 0 interrupted iterations
default   [  47% ] 10/10 VUs  0m48.9s/1m45.0s

running (0m50.0s), 10/10 VUs, 1844 complete and 0 interrupted iterations
default   [  47% ] 10/10 VUs  0m49.9s/1m45.0s

running (0m51.0s), 10/10 VUs, 1876 complete and 0 interrupted iterations
default   [  48% ] 10/10 VUs  0m50.9s/1m45.0s

running (0m52.0s), 10/10 VUs, 1912 complete and 0 interrupted iterations
default   [  49% ] 10/10 VUs  0m51.9s/1m45.0s

running (0m53.0s), 10/10 VUs, 1951 complete and 0 interrupted iterations
default   [  50% ] 10/10 VUs  0m52.9s/1m45.0s

running (0m54.0s), 10/10 VUs, 1987 complete and 0 interrupted iterations
default   [  51% ] 10/10 VUs  0m53.9s/1m45.0s

running (0m55.0s), 10/10 VUs, 2020 complete and 0 interrupted iterations
default   [  52% ] 10/10 VUs  0m54.9s/1m45.0s

running (0m56.0s), 10/10 VUs, 2059 complete and 0 interrupted iterations
default   [  53% ] 10/10 VUs  0m55.9s/1m45.0s

running (0m57.0s), 10/10 VUs, 2098 complete and 0 interrupted iterations
default   [  54% ] 10/10 VUs  0m56.9s/1m45.0s

running (0m58.0s), 10/10 VUs, 2128 complete and 0 interrupted iterations
default   [  55% ] 10/10 VUs  0m57.9s/1m45.0s

running (0m59.0s), 10/10 VUs, 2161 complete and 0 interrupted iterations
default   [  56% ] 10/10 VUs  0m58.9s/1m45.0s

running (1m00.0s), 10/10 VUs, 2194 complete and 0 interrupted iterations
default   [  57% ] 10/10 VUs  0m59.9s/1m45.0s

running (1m01.0s), 10/10 VUs, 2230 complete and 0 interrupted iterations
default   [  58% ] 10/10 VUs  1m00.9s/1m45.0s

running (1m02.0s), 10/10 VUs, 2268 complete and 0 interrupted iterations
default   [  59% ] 10/10 VUs  1m01.9s/1m45.0s

running (1m03.0s), 10/10 VUs, 2301 complete and 0 interrupted iterations
default   [  60% ] 10/10 VUs  1m02.9s/1m45.0s

running (1m04.0s), 10/10 VUs, 2337 complete and 0 interrupted iterations
default   [  61% ] 10/10 VUs  1m03.9s/1m45.0s

running (1m05.0s), 10/10 VUs, 2367 complete and 0 interrupted iterations
default   [  62% ] 10/10 VUs  1m04.9s/1m45.0s

running (1m06.0s), 10/10 VUs, 2397 complete and 0 interrupted iterations
default   [  63% ] 10/10 VUs  1m05.9s/1m45.0s

running (1m07.0s), 10/10 VUs, 2424 complete and 0 interrupted iterations
default   [  64% ] 10/10 VUs  1m06.9s/1m45.0s

running (1m08.0s), 10/10 VUs, 2457 complete and 0 interrupted iterations
default   [  65% ] 10/10 VUs  1m07.9s/1m45.0s

running (1m09.0s), 10/10 VUs, 2488 complete and 0 interrupted iterations
default   [  66% ] 10/10 VUs  1m08.9s/1m45.0s

running (1m10.0s), 10/10 VUs, 2505 complete and 0 interrupted iterations
default   [  67% ] 10/10 VUs  1m09.9s/1m45.0s

running (1m11.0s), 10/10 VUs, 2527 complete and 0 interrupted iterations
default   [  67% ] 10/10 VUs  1m10.9s/1m45.0s

running (1m12.0s), 10/10 VUs, 2557 complete and 0 interrupted iterations
default   [  68% ] 10/10 VUs  1m11.9s/1m45.0s

running (1m13.0s), 10/10 VUs, 2578 complete and 0 interrupted iterations
default   [  69% ] 10/10 VUs  1m12.9s/1m45.0s

running (1m14.0s), 10/10 VUs, 2602 complete and 0 interrupted iterations
default   [  70% ] 10/10 VUs  1m13.9s/1m45.0s

running (1m15.0s), 10/10 VUs, 2623 complete and 0 interrupted iterations
default   [  71% ] 10/10 VUs  1m14.9s/1m45.0s

running (1m16.0s), 10/10 VUs, 2652 complete and 0 interrupted iterations
default   [  72% ] 10/10 VUs  1m15.9s/1m45.0s

running (1m17.0s), 10/10 VUs, 2670 complete and 0 interrupted iterations
default   [  73% ] 10/10 VUs  1m16.9s/1m45.0s

running (1m18.0s), 10/10 VUs, 2687 complete and 0 interrupted iterations
default   [  74% ] 10/10 VUs  1m17.9s/1m45.0s

running (1m19.0s), 10/10 VUs, 2693 complete and 0 interrupted iterations
default   [  75% ] 10/10 VUs  1m18.9s/1m45.0s

running (1m20.0s), 10/10 VUs, 2714 complete and 0 interrupted iterations
default   [  76% ] 10/10 VUs  1m19.9s/1m45.0s

running (1m21.0s), 10/10 VUs, 2746 complete and 0 interrupted iterations
default   [  77% ] 10/10 VUs  1m20.9s/1m45.0s

running (1m22.0s), 10/10 VUs, 2770 complete and 0 interrupted iterations
default   [  78% ] 10/10 VUs  1m21.9s/1m45.0s

running (1m23.0s), 10/10 VUs, 2800 complete and 0 interrupted iterations
default   [  79% ] 10/10 VUs  1m22.9s/1m45.0s

running (1m24.0s), 10/10 VUs, 2812 complete and 0 interrupted iterations
default   [  80% ] 10/10 VUs  1m23.9s/1m45.0s

running (1m25.0s), 10/10 VUs, 2823 complete and 0 interrupted iterations
default   [  81% ] 10/10 VUs  1m24.9s/1m45.0s

running (1m26.0s), 10/10 VUs, 2833 complete and 0 interrupted iterations
default   [  82% ] 10/10 VUs  1m25.9s/1m45.0s

running (1m27.0s), 10/10 VUs, 2842 complete and 0 interrupted iterations
default   [  83% ] 10/10 VUs  1m26.9s/1m45.0s

running (1m28.0s), 10/10 VUs, 2851 complete and 0 interrupted iterations
default   [  84% ] 10/10 VUs  1m27.9s/1m45.0s

running (1m29.0s), 10/10 VUs, 2862 complete and 0 interrupted iterations
default   [  85% ] 10/10 VUs  1m28.9s/1m45.0s

running (1m30.0s), 10/10 VUs, 2871 complete and 0 interrupted iterations
default   [  86% ] 10/10 VUs  1m29.9s/1m45.0s

running (1m31.0s), 10/10 VUs, 2873 complete and 0 interrupted iterations
default   [  87% ] 10/10 VUs  1m30.9s/1m45.0s

running (1m32.0s), 10/10 VUs, 2874 complete and 0 interrupted iterations
default   [  87% ] 10/10 VUs  1m31.9s/1m45.0s

running (1m33.0s), 09/10 VUs, 2880 complete and 0 interrupted iterations
default   [  88% ] 09/10 VUs  1m32.9s/1m45.0s

running (1m34.0s), 08/10 VUs, 2889 complete and 0 interrupted iterations
default   [  89% ] 08/10 VUs  1m33.9s/1m45.0s

running (1m35.0s), 07/10 VUs, 2918 complete and 0 interrupted iterations
default   [  90% ] 07/10 VUs  1m34.9s/1m45.0s

running (1m36.0s), 07/10 VUs, 2952 complete and 0 interrupted iterations
default   [  91% ] 07/10 VUs  1m35.9s/1m45.0s

running (1m37.0s), 06/10 VUs, 2990 complete and 0 interrupted iterations
default   [  92% ] 06/10 VUs  1m36.9s/1m45.0s

running (1m38.0s), 05/10 VUs, 3014 complete and 0 interrupted iterations
default   [  93% ] 05/10 VUs  1m37.9s/1m45.0s

running (1m39.0s), 05/10 VUs, 3040 complete and 0 interrupted iterations
default   [  94% ] 05/10 VUs  1m38.9s/1m45.0s

running (1m40.0s), 04/10 VUs, 3073 complete and 0 interrupted iterations
default   [  95% ] 04/10 VUs  1m39.9s/1m45.0s

running (1m41.0s), 04/10 VUs, 3091 complete and 0 interrupted iterations
default   [  96% ] 04/10 VUs  1m40.9s/1m45.0s

running (1m42.0s), 03/10 VUs, 3113 complete and 0 interrupted iterations
default   [  97% ] 03/10 VUs  1m41.9s/1m45.0s

running (1m43.0s), 02/10 VUs, 3133 complete and 0 interrupted iterations
default   [  98% ] 02/10 VUs  1m42.9s/1m45.0s

running (1m44.0s), 01/10 VUs, 3153 complete and 0 interrupted iterations
default   [  99% ] 01/10 VUs  1m43.9s/1m45.0s

running (1m45.0s), 01/10 VUs, 3168 complete and 0 interrupted iterations
default   [ 100% ] 01/10 VUs  1m44.9s/1m45.0s


  █ THRESHOLDS 

    http_req_duration{stage:ingress}
    ✗ 'p(95)<500' p(95)=627.33ms
    ✗ 'p(99)<900' p(99)=1.18s

    http_req_failed{stage:ingress}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 6348    60.370906/s
    checks_succeeded...: 100.00% 6348 out of 6348
    checks_failed......: 0.00%   0 out of 6348

    ✓ organization created
    ✓ workflow created
    ✓ workflow version published
    ✓ warmup webhook accepted
    ✓ webhook accepted
    ✓ execution id returned

    HTTP
    http_req_duration..............: avg=263.08ms min=15.94ms med=230.32ms max=3.79s p(90)=387.15ms p(95)=626.13ms p(99)=1.18s
      { expected_response:true }...: avg=263.08ms min=15.94ms med=230.32ms max=3.79s p(90)=387.15ms p(95)=626.13ms p(99)=1.18s
      { stage:ingress }............: avg=263.37ms min=27.78ms med=230.4ms  max=3.79s p(90)=387.32ms p(95)=627.33ms p(99)=1.18s
    http_req_failed................: 0.00%  0 out of 3176
      { stage:ingress }............: 0.00%  0 out of 3172
    http_reqs......................: 3176   30.204473/s

    EXECUTION
    iteration_duration.............: avg=263.47ms min=27.88ms med=230.53ms max=3.79s p(90)=387.42ms p(95)=627.43ms p(99)=1.18s
    iterations.....................: 3172   30.166432/s
    vus............................: 1      min=1         max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 4.1 MB 39 kB/s
    data_sent......................: 1.5 MB 14 kB/s



running (1m45.1s), 00/10 VUs, 3172 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  1m45s

time="2026-07-01T00:20:25-03:00" level=error msg="thresholds on metrics 'http_req_duration{stage:ingress}' have been crossed"